
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Запуск длительной операции для теста.
//
// Параметры:
//  ТипТеста - Число - номер теста.
//
Процедура ЗапускДлительнойОперацииДляТеста(Знач ТипТеста) Экспорт
	
	ВремяЗавершения = ТекущаяДатаСеанса() + 3;
	Пока ТекущаяДатаСеанса() < ВремяЗавершения Цикл
	КонецЦикла;
	
	Если ТипТеста = 1 Тогда
		ОбщегоНазначения.СообщитьПользователю("Сообщение");
	ИначеЕсли ТипТеста = -1 Тогда
		ВызватьИсключение "Ошибка";
	Иначе
		// все хорошо
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли