
// BSLLS:BeginTransactionBeforeTryCatch-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off
// BSLLS:PairingBrokenTransaction-off
// BSLLS:PublicMethodsDescription-off
// BSLLS:UsingServiceTag-off
// BSLLS:WrongUseOfRollbackTransactionMethod-off

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем КонтекстЯдра; // Контекст проигрывателя тестов
Перем Ожидаем; // Контекст плагина с методами проверки утверждений

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область xddTestRunner

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	НаборТестов.Добавить("Тест_ДобавитьМинутыКДатеСГрафикомКоличествоМинутМеньшеГрафика");
	НаборТестов.Добавить("Тест_ДобавитьМинутыКДатеСГрафикомКоличествоМинутБольшеГрафика");
	
КонецПроцедуры

#КонецОбласти

#Область ЮнитТесты

#Область ОбщиеПроцедурыТестов

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ОписаниеТестов

Процедура Тест_ДобавитьМинутыКДатеСГрафикомКоличествоМинутМеньшеГрафика() Экспорт
	
	Результат = фмДатаВремяКлиентСервер.ДобавитьМинутыКДатеСГрафиком(Дата('20171010100000'), 120, Дата('00010101080000'), Дата('00010101210000'));
	Ожидаем.Что(Результат, "дата должна получится в этот же день").Равно(Дата('20171010120000'));
	
КонецПроцедуры

Процедура Тест_ДобавитьМинутыКДатеСГрафикомКоличествоМинутБольшеГрафика() Экспорт
	
	Результат = фмДатаВремяКлиентСервер.ДобавитьМинутыКДатеСГрафиком(Дата('20171010100000'), 2400, Дата('00010101080000'), Дата('00010101210000'));
	Ожидаем.Что(Результат, "дата должна получится на следующие дни").Равно(Дата('20171013110000'));
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли