
// BSLLS:BeginTransactionBeforeTryCatch-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off
// BSLLS:PairingBrokenTransaction-off
// BSLLS:PublicMethodsDescription-off
// BSLLS:UsingServiceTag-off
// BSLLS:WrongUseOfRollbackTransactionMethod-off

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем КонтекстЯдра; // Контекст проигрывателя тестов
Перем Ожидаем; // Контекст плагина с методами проверки утверждений

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область xddTestRunner

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	НаборТестов.Добавить("Тест_МассивЗначенийКолонкиТаблицы_Успех");
	НаборТестов.Добавить("Тест_МассивЗначенийКолонкиТаблицы_ТаблицаНеНайдена");
	НаборТестов.Добавить("Тест_МассивЗначенийКолонкиТаблицы_КолонкаНеНайдена");
	
КонецПроцедуры

#КонецОбласти

#Область ЮнитТесты

#Область ОбщиеПроцедурыТестов

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ОписаниеТестов

Процедура Тест_МассивЗначенийКолонкиТаблицы_Успех() Экспорт
	
	Менеджер = Новый МенеджерВременныхТаблиц();
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Менеджер;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	""1"" КАК Ссылка
	|ПОМЕСТИТЬ Склады
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""2""";
	Запрос.Выполнить();
	
	Результат = фмРаботаСЗапросами.МассивЗначенийКолонкиТаблицы(Менеджер, "Склады", "Ссылка");
	
	Ожидаем.Что(Результат, "результат").ИмеетТип(Тип("Массив"));
	Ожидаем.Что(Результат.Количество(), "количество элементов").Равно(2);
	
КонецПроцедуры

Процедура Тест_МассивЗначенийКолонкиТаблицы_ТаблицаНеНайдена() Экспорт
	
	Менеджер = Новый МенеджерВременныхТаблиц();
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Менеджер;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	""1"" КАК Ссылка
	|ПОМЕСТИТЬ Склады
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""2""";
	Запрос.Выполнить();
	
	ПараметрыМетода = ОбщегоНазначенияКлиентСервер.МассивЗначений("Ссылка", "СкладыДругой", Менеджер);
	Ожидаем
		.Что(фмРаботаСЗапросами, "Модуль")
		.Метод("МассивЗначенийКолонкиТаблицы", ПараметрыМетода)
		.ВыбрасываетИсключение("Таблица с именем ""СкладыДругой"" не найдена в МенеджерВременныхТаблиц");
	
КонецПроцедуры

Процедура Тест_МассивЗначенийКолонкиТаблицы_КолонкаНеНайдена() Экспорт
	
	Менеджер = Новый МенеджерВременныхТаблиц();
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Менеджер;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	""1"" КАК Ссылка
	|ПОМЕСТИТЬ Склады
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""2""";
	Запрос.Выполнить();
	
	ПараметрыМетода = ОбщегоНазначенияКлиентСервер.МассивЗначений("СсылкаДругая", "Склады", Менеджер);
	Ожидаем
		.Что(фмРаботаСЗапросами, "Модуль")
		.Метод("МассивЗначенийКолонкиТаблицы", ПараметрыМетода)
		.ВыбрасываетИсключение("Колонка с именем ""СсылкаДругая"" не найдена в таблице ""Склады""");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
