
#Область ПрограммныйИнтерфейс

// Прочитать значение параметра.
//
// Параметры:
//  ИмяПараметра        - Строка - имя параметра.
//  ЗначениеПоУмолчанию - Строка, Число, Булево, Дата - значение по умолчанию.
// 
// Возвращаемое значение:
//  Строка, Число, Булево, Дата - значение параметра.
//
Функция ПрочитатьЗначениеПараметра(Знач ИмяПараметра, Знач ЗначениеПоУмолчанию = Неопределено) Экспорт
	Возврат sphПараметрыВызовСервера.ПрочитатьЗначениеПараметра(ИмяПараметра, ЗначениеПоУмолчанию);
КонецФункции

#КонецОбласти