
#Область ПрограммныйИнтерфейс

// Нужно писать отладочные сообщения.
//
// Параметры:
//  ИерархияСобытия - Строка, ОбъектМетаданных - иерархия события.
// 
// Возвращаемое значение:
//  Булево - если Истина, то отладка включена.
//
Функция ОтладкаВключена(Знач ИерархияСобытия) Экспорт
	Возврат фмЛоггерПереопределяемый.ОтладкаВключена(ИерархияСобытия);
КонецФункции

// Нужно писать сообщения пользователю.
//
// Параметры:
//  ИерархияСобытия - Строка, ОбъектМетаданных - иерархия события.
// 
// Возвращаемое значение:
//  Булево - если Истина, то нужно писать сообщения пользователю.
//
Функция СообщенияПользователюВключены(Знач ИерархияСобытия) Экспорт
	Возврат фмЛоггерПереопределяемый.СообщенияПользователюВключены(ИерархияСобытия);
КонецФункции

#КонецОбласти