
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если МассивЗначений.Количество() = 0 И Не ЗначениеЗаполнено(Значение) Тогда
		ОбщегоНазначения.СообщитьПользователю("Заполните значение", , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если МассивЗначений.Количество() = 1 Тогда
		ЭтоМассивЗначений = Ложь;
		Значение = МассивЗначений[0].Значение;
	ИначеЕсли МассивЗначений.Количество() > 1 Тогда
		ЭтоМассивЗначений = Истина;
		Значение = Неопределено;
	Иначе
		ВызватьИсключение "Значение не заполнено";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли