
// BSLLS:BeginTransactionBeforeTryCatch-off
// BSLLS:MagicNumber-off
// BSLLS:PairingBrokenTransaction-off
// BSLLS:PublicMethodsDescription-off
// BSLLS:UsingServiceTag-off
// BSLLS:WrongUseOfRollbackTransactionMethod-off

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем КонтекстЯдра; // Контекст проигрывателя тестов
Перем Ожидаем; // Контекст плагина с методами проверки утверждений

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область xddTestRunner

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	НаборТестов.Добавить("Тест_Пинг");
	НаборТестов.Добавить("Тест_ОбработкаИсключения");
	
КонецПроцедуры

#КонецОбласти

#Область ЮнитТесты

#Область ОбщиеПроцедурыТестов

Процедура ПередЗапускомТеста() Экспорт
	
	НачатьТранзакцию();
	
	МенеджерЗаписи = РегистрыСведений.фмПараметры.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяПараметра = "ЛоггерВключитьОтладку";
	МенеджерЗаписи.ЗначениеПараметра = "фмОбработчикЗапросовСервиса";
	МенеджерЗаписи.Записать();
	
	МенеджерЗаписи = РегистрыСведений.фмПараметры.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяПараметра = "ЛоггерВключитьСообщенияПользователю";
	МенеджерЗаписи.ЗначениеПараметра = "фмОбработчикЗапросовСервиса";
	МенеджерЗаписи.Записать();
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
	Если ТранзакцияАктивна() Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОписаниеТестов

Процедура Тест_Пинг() Экспорт
	
	Ответ = фмОбработчикЗапросовСервиса.ОбработатьЗапрос(Новый HTTPЗапрос(), "фмОбработчикЗапросовСервиса.ПроверитьСоединение");
	Ожидаем.Что(Ответ.КодСостояния, "код состояния").Равно(200);
	
КонецПроцедуры

Процедура Тест_ОбработкаИсключения() Экспорт
	
	Ответ = фмОбработчикЗапросовСервиса.ОбработатьЗапрос(Новый HTTPЗапрос(), "фмДатаВремяКлиентСервер.ДобавитьМинутыКДатеСГрафиком");
	Ожидаем.Что(Ответ.ПолучитьТелоКакСтроку(), "ответ").Содержит("Недостаточно фактических параметров");
	Ожидаем.Что(Ответ.КодСостояния, "код состояния").Равно(500);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
