
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создать объект.
//
// Параметры:
//  Логгер              - ОбработкаОбъект.фмЛоггер - объект для записи лога.
//  ПараметрыСоединения - Структура - см. ПараметрыСоединения().
// 
// Возвращаемое значение:
//  ОбработкаОбъект.фмHTTPСоединениеСЛогированием - объект для отправки запросов.
//
Функция СоздатьОбъект(Знач Логгер, Знач ПараметрыСоединения) Экспорт
	
	НовыйОбъект = Обработки.фмHTTPСоединениеСЛогированием.Создать();
	НовыйОбъект.Инициализация(Логгер, ПараметрыСоединения);
	
	Возврат НовыйОбъект;
	
КонецФункции

// Параметры соединение.
// 
// Возвращаемое значение:
//  Структура - параметры.
//
Функция ПараметрыСоединения() Экспорт
	
	Структура = Новый Структура();
	Структура.Вставить("Сервер", "");
	Структура.Вставить("Порт", Неопределено);
	Структура.Вставить("Пользователь", Неопределено);
	Структура.Вставить("Пароль", Неопределено);
	Структура.Вставить("Прокси", Неопределено);
	Структура.Вставить("Таймаут", 60);
	Структура.Вставить("ЗащищенноеСоединение", Неопределено);
	Структура.Вставить("ИспользоватьАутентификациюОС", Ложь);
	
	Возврат Структура;
	
КонецФункции

#КонецОбласти

#КонецЕсли
