
// BSLLS:BeginTransactionBeforeTryCatch-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off
// BSLLS:PairingBrokenTransaction-off
// BSLLS:PublicMethodsDescription-off
// BSLLS:UsingServiceTag-off
// BSLLS:WrongUseOfRollbackTransactionMethod-off

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем КонтекстЯдра; // Контекст проигрывателя тестов
Перем Ожидаем; // Контекст плагина с методами проверки утверждений

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область xddTestRunner

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	НаборТестов.Добавить("Тест_СовпадаетСШаблоном");
	НаборТестов.Добавить("Тест_НеСовпадаетСШаблоном");
	
КонецПроцедуры

#КонецОбласти

#Область ЮнитТесты

#Область ОбщиеПроцедурыТестов

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ОписаниеТестов

Процедура Тест_СовпадаетСШаблоном() Экспорт
	
	РезультатПроверки = фмРегулярныеВыраженияКлиентСервер.ПроверитьСтроку("111111111111111111111111111", "\d{14}[a-zA-Z0-9]{13}");
	Ожидаем.Что(РезультатПроверки).ЭтоИстина();
	
КонецПроцедуры

Процедура Тест_НеСовпадаетСШаблоном() Экспорт
	
	РезультатПроверки = фмРегулярныеВыраженияКлиентСервер.ПроверитьСтроку("1", "\d{14}[a-zA-Z0-9]{13}");
	Ожидаем.Что(РезультатПроверки).ЭтоЛожь();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
