
#Область ПрограммныйИнтерфейс

// Устанавливает параметры сеанса, относящихся к подсистеме фмПараметрыПрограммы.
//
// Параметры:
//   ТребуемыеПараметры - Неопределено, Массив из Строка - параметры для инициализации.
//
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры) Экспорт
	
	Если ТребуемыеПараметры <> Неопределено И ТребуемыеПараметры.Найти("фмТекущаяОбластьПримененияПараметра") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСеанса.фмТекущаяОбластьПримененияПараметра = Ложь;
	
КонецПроцедуры

#КонецОбласти
