
#Область ПрограммныйИнтерфейс

// Прочитать значение параметра.
//
// Параметры:
//  ИмяПараметра        - Строка - имя параметра.
//  ЗначениеПоУмолчанию - ОпределяемыйТип.фмЗначениеПараметра - значение по умолчанию.
//  ОбластьПрименения	- ОпределяемыйТип.фмОбластьПримененияПараметра, Неопределено - переопределить область применения.
// 
// Возвращаемое значение:
//  ОпределяемыйТип.фмЗначениеПараметра - значение параметра.
//
Функция ПрочитатьЗначениеПараметра(Знач ИмяПараметра, Знач ЗначениеПоУмолчанию = Неопределено, ОбластьПрименения = Неопределено) Экспорт
	Возврат РегистрыСведений.фмПараметры.ПрочитатьЗначениеПараметра(ИмяПараметра, ЗначениеПоУмолчанию, ОбластьПрименения);
КонецФункции

// Устанавливает параметры сеанса, относящихся к подсистеме фмПараметрыПрограммы.
//
// Параметры:
//   ТребуемыеПараметры - Неопределено, Массив из Строка - параметры для инициализации.
//
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры) Экспорт
	
	Если ТребуемыеПараметры <> Неопределено И ТребуемыеПараметры.Найти("фмТекущаяОбластьПримененияПараметра") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	фмПараметрыПереопределяемый.УстановитьПараметрТекущаяОбластьПримененияПараметра();
	
КонецПроцедуры

#КонецОбласти
