
#Область ПрограммныйИнтерфейс

// Сообщения пользователю из сеанса текущего пользователя, которые не были показаны, одной строкой.
// 
// Возвращаемое значение:
//  Строка - текст сообщений.
//
Функция СообщенияПользователюВСтроку() Экспорт
	
	СообщенияПользователю = ПолучитьСообщенияПользователю(Истина);
	Если СообщенияПользователю.Количество() = 0 Тогда 
		Возврат "";
	КонецЕсли;
	
	Массив = Новый Массив;
	Для Каждого Сообщение Из СообщенияПользователю Цикл
		Массив.Добавить(Сообщение.Текст);
	КонецЦикла;
	
	Возврат СтрСоединить(Массив, Символы.ПС);
	
КонецФункции

#КонецОбласти