
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ПолучитьСодержимоеФайлаОшибок());
	ТекстовыйДокумент.Показать("error.log");
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьСодержимоеФайлаОшибок()
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(Обработки.фмЛоггер.ПолучитьИмяФайлаСЛогом(), КодировкаТекста.UTF8);
	
	Возврат ТекстовыйДокумент.ПолучитьТекст();
	
КонецФункции

#КонецОбласти
