
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(СодержимоеФайлаОшибок());
	ТекстовыйДокумент.Показать("error.log");
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СодержимоеФайлаОшибок()
	
	ИмяФайла = Обработки.фмЛоггер.ПолучитьИмяФайлаСЛогом();
	Файл = Новый Файл(ИмяФайла);
	Если Не Файл.Существует() Тогда
		ВызватьИсключение "Файл с логом не существует";
	КонецЕсли;
	
	МаксимальныйРазмерДляПоказа = 10000000;
	Если Файл.Размер() > МаксимальныйРазмерДляПоказа Тогда
		ВызватьИсключение "Лог очень большой";
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ИмяФайла, КодировкаТекста.UTF8);
	
	Возврат ТекстовыйДокумент.ПолучитьТекст();
	
КонецФункции

#КонецОбласти