
#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура Ошибка(Знач ИмяСобытия, Знач Сообщение, Знач Данные = Неопределено) Экспорт
	ОшибкаНаСервере(ИмяСобытия, ПреобразоватьСообщение(Сообщение), Данные);
КонецПроцедуры

&НаКлиенте
Процедура Информация(Знач ИмяСобытия, Знач Сообщение, Знач Данные = Неопределено) Экспорт
	ИнформацияНаСервере(ИмяСобытия, ПреобразоватьСообщение(Сообщение), Данные);
КонецПроцедуры

&НаКлиенте
Процедура Отладка(Знач ИмяСобытия, Знач Сообщение, Знач Данные = Неопределено) Экспорт
	ОтладкаНаСервере(ИмяСобытия, ПреобразоватьСообщение(Сообщение), Данные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПреобразоватьСообщение(Знач Сообщение)
	
	Результат = Сообщение;
	
	Если ТипЗнч(Сообщение) = Тип("ИнформацияОбОшибке") Тогда
		Результат =  Новый Структура("КраткоеПредставление, ПодробноеПредставление",
		                             КраткоеПредставлениеОшибки(Сообщение),
		                             ПодробноеПредставлениеОшибки(Сообщение));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОшибкаНаСервере(Знач ИмяСобытия, Знач Сообщение, Знач Данные = Неопределено)
	
	Логгер = фмЛоггер.СоздатьЛоггер(ИерархияСобытия, ИмяКлиента);
	Логгер.Ошибка(ИмяСобытия, Сообщение, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ИнформацияНаСервере(Знач ИмяСобытия, Знач Сообщение, Знач Данные = Неопределено)
	
	Логгер = фмЛоггер.СоздатьЛоггер(ИерархияСобытия, ИмяКлиента);
	Логгер.Информация(ИмяСобытия, Сообщение, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ОтладкаНаСервере(Знач ИмяСобытия, Знач Сообщение, Знач Данные = Неопределено)
	
	Логгер = фмЛоггер.СоздатьЛоггер(ИерархияСобытия, ИмяКлиента);
	Логгер.Отладка(ИмяСобытия, Сообщение, Данные);
	
КонецПроцедуры

#КонецОбласти