
#Область ПрограммныйИнтерфейс

// Текущая область применения параметра.
// 
// Возвращаемое значение:
//  ОпределяемыйТип.фмОбластьПримененияПараметра - область применения параметра.
//
Функция ТекущаяОбластьПримененияПараметра() Экспорт
	Возврат ПараметрыСеанса.фмТекущаяОбластьПримененияПараметра;
КонецФункции

// Пустое значение определяемого типа фмОбластьПримененияПараметра.
// 
// Возвращаемое значение:
//  Массив Из Неопределено - массив пустых значений.
//
Функция ПустоеЗначениеОбластьПрименения() Экспорт
	
	Массив = фмКонструкторы.ПустыеЗначенияТипов(Метаданные.ОпределяемыеТипы.фмОбластьПримененияПараметра.Тип);
	Возврат Новый ФиксированныйМассив(Массив);
	
КонецФункции

// Используется функционал область применения параметра.
// 
// Возвращаемое значение:
//  Булево - если Истина, то используется.
//
Функция ИспользуетсяОбластьПримененияПараметра() Экспорт
	
	Результат = Истина;
	ПустоеЗначение = фмПараметрыПовтИсп.ПустоеЗначениеОбластьПрименения();
	Если ПустоеЗначение.Количество() = 1 Тогда
		Результат = (ПустоеЗначение.Найти(Ложь) = Неопределено);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти