
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТест("ЗаписатьОшибкуНаКлиенте", "Записать ошибку на клиенте");
	
КонецПроцедуры

#КонецОбласти

#Область Тесты

Процедура ЗаписатьОшибкуНаКлиенте() Экспорт
	
	Логгер = фмЛоггерКлиентСервер.СоздатьЛоггер("Тест");
	Попытка
		ВызватьИсключение "падаем";
	Исключение
		Логгер.Ошибка("Исключение", ИнформацияОбОшибке());
	КонецПопытки;
	
	Документ =  Новый ТекстовыйДокумент();
	Документ.Прочитать(ЮТест.КонтекстМодуля().ПутьКЛогу);
	Текст = Документ.ПолучитьТекст();
	
	ЮТест
		.ОжидаетЧто(Текст, "сообщения пользователю")
		.Содержит("""Level"":""Ошибка"",""Event"":""Тест.Исключение""");
	
КонецПроцедуры

#КонецОбласти

#Область События

Процедура ПередВсемиТестами() Экспорт
	
	ПутьКЛогу = ПолучитьИмяВременногоФайла("txt");
	ЮТест.Контекст().УстановитьЗначение("ПутьКЛогу", ПутьКЛогу);
	фмлог_ВызовСервера.ЛоггерПутьКФайлу(ПутьКЛогу);
	
КонецПроцедуры

#КонецОбласти