
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТест("ЗаписатьОшибкуНаКлиенте", "Записать ошибку на клиенте");
	
КонецПроцедуры

#КонецОбласти

#Область Тесты

Процедура ЗаписатьОшибкуНаКлиенте() Экспорт
	
	ПутьКЛогу = ПолучитьИмяВременногоФайла("txt");
	фмлог_ВызовСервера.ЛоггерПутьКФайлу(ПутьКЛогу);
	ОбновитьПовторноИспользуемыеЗначения();
	
	Логгер = фмЛоггерКлиентСервер.СоздатьЛоггер("Тест");
	Попытка
		ВызватьИсключение "падаем";
	Исключение
		Логгер.Ошибка("Исключение", ИнформацияОбОшибке());
	КонецПопытки;
	
	Файл = Новый Файл(ПутьКЛогу);
	ЮТест
		.ОжидаетЧто(Файл.Существует(), "файл существует")
		.Равно(Истина);
	
	Документ =  Новый ТекстовыйДокумент();
	Документ.Прочитать(ПутьКЛогу);
	Текст = Документ.ПолучитьТекст();
	
	ЮТест
		.ОжидаетЧто(Текст, "текст лога")
		.Содержит("""Level"":""Ошибка"",""Event"":""Тест.Исключение""");
	
КонецПроцедуры

#КонецОбласти

#Область События

Процедура ПередВсемиТестами() Экспорт
	
КонецПроцедуры

#КонецОбласти