
#Область ПрограммныйИнтерфейс

// Число секунд от начала Unix эпохи.
//
// Параметры:
//  Дата		 - Дата	 - дата.
//  ЧасовойПояс	 - Строка, Неопределено - Идентификатор часового пояса, к которому относится время (см. УниверсальноеВремя).
// 
// Возвращаемое значение:
//  Число - число секунд.
//
Функция ДатаВTimestamp(Знач Дата, Знач ЧасовойПояс = Неопределено) Экспорт
	
	Время = УниверсальноеВремя(Дата, ЧасовойПояс);
	Возврат Время - НачалоЭпохиLinux();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НачалоЭпохиLinux()
	Возврат '19700101';
КонецФункции

#КонецОбласти
