
#Область ПрограммныйИнтерфейс

// Записать ошибку.
//
// Параметры:
//  ИмяКлиента      - Строка - имя клиента, на котором произошло событие.
//  ИерархияСобытия - Строка - иерархия события.
//  ИмяСобытия      - Строка - имя события.
//  Сообщение       - Строка - произвольная строка комментария к событию.
//  Данные          - ЛюбаяСсылка, Число, Строка, Дата, Булево - данные, с которыми связано событие.
//
Процедура Ошибка(Знач ИмяКлиента, Знач ИерархияСобытия, Знач ИмяСобытия, Знач Сообщение, Знач Данные = Неопределено) Экспорт
	
	Логгер = фмЛоггерПовтИсп.СоздатьЛоггер(ИерархияСобытия, ИмяКлиента);
	Логгер.Ошибка(ИмяСобытия, Сообщение, Данные);
	
КонецПроцедуры

// Записать информацию.
//
// Параметры:
//  ИмяКлиента      - Строка - имя клиента, на котором произошло событие.
//  ИерархияСобытия - Строка - иерархия события.
//  ИмяСобытия      - Строка - имя события.
//  Сообщение       - Строка - произвольная строка комментария к событию.
//  Данные          - ЛюбаяСсылка, Число, Строка, Дата, Булево - данные, с которыми связано событие.
//
Процедура Информация(Знач ИмяКлиента, Знач ИерархияСобытия, Знач ИмяСобытия, Знач Сообщение, Знач Данные = Неопределено) Экспорт
	
	Логгер = фмЛоггерПовтИсп.СоздатьЛоггер(ИерархияСобытия, ИмяКлиента);
	Логгер.Информация(ИмяСобытия, Сообщение, Данные);
	
КонецПроцедуры

// Записать отладочную информацию.
//
// Параметры:
//  ИмяКлиента      - Строка - имя клиента, на котором произошло событие.
//  ИерархияСобытия - Строка - иерархия события.
//  ИмяСобытия      - Строка - имя события.
//  Сообщение       - Строка - произвольная строка комментария к событию.
//  Данные          - ЛюбаяСсылка, Число, Строка, Дата, Булево - данные, с которыми связано событие.
//
Процедура Отладка(Знач ИмяКлиента, Знач ИерархияСобытия, Знач ИмяСобытия, Знач Сообщение, Знач Данные = Неопределено) Экспорт
	
	Логгер = фмЛоггерПовтИсп.СоздатьЛоггер(ИерархияСобытия, ИмяКлиента);
	Логгер.Отладка(ИмяСобытия, Сообщение, Данные);
	
КонецПроцедуры

#КонецОбласти