
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создать объект
//
// Параметры:
//  ИерархияСобытия - Строка, ОбъектМетаданных - иерархия события.
//  ИмяКлиента - Строка - переопределить имя компьютера, на котором произошло событие.
// 
// Возвращаемое значение:
//  ОбработкаОбъект.фмЛоггер - объект для записи лога.
//
Функция СоздатьОбъект(Знач ИерархияСобытия, Знач ИмяКлиента = "") Экспорт
	
	Логгер = Обработки.фмЛоггер.Создать();
	Логгер.Инициализация(ИерархияСобытия, ИмяКлиента);
	
	Возврат Логгер;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получить имя файла с логом.
// 
// Возвращаемое значение:
//  Строка - имя файла, где хранится лог.
//
Функция ПолучитьИмяФайлаСЛогом() Экспорт
	
	ПутьКФайлу = фмЛоггерПереопределяемый.ПутьКФайлу();
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ПутьКФайлу;
	
КонецФункции

#КонецОбласти

#КонецЕсли
