
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Получить имя файла с логом.
// 
// Возвращаемое значение:
//  Строка - имя файла, где хранится лог.
//
Функция ПолучитьИмяФайлаСЛогом() Экспорт
	
	ПутьКФайлу = фмЛоггерПереопределяемый.ПутьКФайлу();
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ПутьКФайлу;
	
КонецФункции

// Преобразовать в строку ИерархияСобытия
//
// Параметры:
//  ИерархияСобытия	 - Строка, ОбъектМетаданных - иерархия события лога.
// 
// Возвращаемое значение:
//  Строка - строковое представление.
//
Функция ИерархияСобытияВСтроку(Знач ИерархияСобытия) Экспорт
	
	Если ТипЗнч(ИерархияСобытия) = Тип("Строка") Тогда
		Возврат ИерархияСобытия;
	Иначе
		Возврат ИерархияСобытия.Имя;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
