
// BSLLS:BeginTransactionBeforeTryCatch-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off
// BSLLS:PairingBrokenTransaction-off
// BSLLS:PublicMethodsDescription-off
// BSLLS:UsingServiceTag-off
// BSLLS:WrongUseOfRollbackTransactionMethod-off

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем КонтекстЯдра; // Контекст проигрывателя тестов
Перем Ожидаем; // Контекст плагина с методами проверки утверждений

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область xddTestRunner

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	НаборТестов.Добавить("Тест_ПроверитьЗаполненностьКолонокРеквизитаФормы_НеЗаполнено");
	НаборТестов.Добавить("Тест_ПроверитьЗаполненностьКолонокРеквизитаФормы_Заполнено");
	
КонецПроцедуры

#КонецОбласти

#Область ЮнитТесты

#Область ОбщиеПроцедурыТестов

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ОписаниеТестов

Процедура Тест_ПроверитьЗаполненностьКолонокРеквизитаФормы_НеЗаполнено() Экспорт
	
	ИмяТаблицы = "Таблица";
	ИменаКолонок = "Колонка";
	Таблица = Новый Массив();
	СтрокаТаблицы = Новый Структура(ИменаКолонок, "");
	Таблица.Добавить(СтрокаТаблицы);
	Форма = Новый Структура();
	Форма.Вставить(ИмяТаблицы, Таблица);
	Элементы = Новый Структура();
	Элементы.Вставить(ИмяТаблицы + ИменаКолонок, Новый Структура("Заголовок", "ЗаголовокКолонки"));
	Форма.Вставить("Элементы", Элементы);
	
	Отказ = Ложь;
	фмПроверкиЗаполнения.ПроверитьЗаполненностьКолонокРеквизитаФормы(Форма, ИмяТаблицы, ИменаКолонок, Отказ);
	
	Ожидаем.Что(Отказ, "Отказ").Равно(Истина);
	Сообщение = "Не заполнена колонка ""ЗаголовокКолонки"" в строке 1 списка ""Таблица""";
	Ожидаем.Что(фмОбработкаСообщенийПользователю.СообщенияПользователюВСтроку(), "сообщение").Равно(Сообщение);
	
КонецПроцедуры

Процедура Тест_ПроверитьЗаполненностьКолонокРеквизитаФормы_Заполнено() Экспорт
	
	ИмяТаблицы = "Таблица";
	ИменаКолонок = "Колонка";
	Таблица = Новый Массив();
	СтрокаТаблицы = Новый Структура(ИменаКолонок, "1");
	Таблица.Добавить(СтрокаТаблицы);
	Форма = Новый Структура();
	Форма.Вставить(ИмяТаблицы, Таблица);
	Элементы = Новый Структура();
	Элементы.Вставить(ИмяТаблицы + ИменаКолонок, Новый Структура("Заголовок", "ЗаголовокКолонки"));
	Форма.Вставить("Элементы", Элементы);
	
	Отказ = Ложь;
	фмПроверкиЗаполнения.ПроверитьЗаполненностьКолонокРеквизитаФормы(Форма, ИмяТаблицы, ИменаКолонок, Отказ);
	
	Ожидаем.Что(Отказ, "Отказ").Равно(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
