
#Область ПрограммныйИнтерфейс

// Проверить принадлежность ошибки определенному типу.
//
// Параметры:
//  ИнформацияОбОшибке - ИнформацияОбОшибке - ошибки при попытке.
//  КатегорияОшибки    - Строка - описание ошибки.
//  ПроверятьПричину   - Ложь - описание ошибки получать из свойство Причина.
// 
// Возвращаемое значение:
//  Булево - если Истина, ошибка принадлежит категории.
//
Функция ЯвляетсяОшибкойНужногоТипа(Знач ИнформацияОбОшибке, Знач КатегорияОшибки, Знач ПроверятьПричину = Ложь) Экспорт
	
	Если ПустаяСтрока(КатегорияОшибки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПроверятьПричину Тогда
		Описание = ИнформацияОбОшибке.Причина.Описание;
	Иначе
		Описание = ИнформацияОбОшибке.Описание;
	КонецЕсли;
	
	Возврат СтрНайти(Описание, КатегорияОшибки) > 0;
	
КонецФункции

#КонецОбласти
