
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.УдалениеТестовыхДанных()
		.ДобавитьСерверныйТест("СохранитьОбъектXDTOВJson", "Метод модуля для сохранения XDTO в JSON")
		.ДобавитьСерверныйТест("ПлатформаСохраняетОбъектXDTOВJson", "Метод платформы для сохранения XDTO в JSON");
	
КонецПроцедуры

#КонецОбласти

#Область Тесты

Процедура СохранитьОбъектXDTOВJson() Экспорт
	
	Объект = СоздатьОбъект();
	Текст = фмСериализацияКлиентСервер.СохранитьОбъектXDTOВJson(Объект);
	
	ЮТест
		.ОжидаетЧто(Текст, "результат")
		.Содержит("""ЧислоСложныйТип"": 10.5", "выгружен ЧислоСложныйТип");
	
КонецПроцедуры

Процедура ПлатформаСохраняетОбъектXDTOВJson() Экспорт
	
	Объект = СоздатьОбъект();
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьJSON(ЗаписьJSON, Объект);
	Текст = ЗаписьJSON.Закрыть();
	
	ЮТест
		.ОжидаетЧто(Текст, "результат")
		.НеСодержит("""ЧислоСложныйТип"": 10.5", "выгружен ЧислоСложныйТип");
	
КонецПроцедуры

#КонецОбласти

#Область События

Процедура ПередВсемиТестами() Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьОбъект()
	
	ТипОбъект = ФабрикаXDTO.Тип("http://www.sample-package.org", "Объект");
	Объект = ФабрикаXDTO.Создать(ТипОбъект);
	Объект.Строка = "1";
	Объект.ЧислоDecimal = 10.5;
	Объект.ЧислоСложныйТип = 10.5;
	
	Возврат Объект;
	
КонецФункции

#КонецОбласти