
#Область ПрограммныйИнтерфейс

// Пустые значения типов.
//
// Параметры:
//  ОписаниеТипов - ОписаниеТипов - описание типа.
// 
// Возвращаемое значение:
//  Массив Из Неопределено - пустое значение.
//
Функция ПустыеЗначенияТипов(Знач ОписаниеТипов) Экспорт
	
	Результат = Новый Массив();
	
	Типы = ОписаниеТипов.Типы();
	Для Каждого ТипЗначения Из Типы Цикл
		Если ТипЗначения = Тип("Булево") Тогда
			Результат.Добавить(Ложь);
		ИначеЕсли ТипЗначения = Тип("Число") Тогда
			Результат.Добавить(0);
		ИначеЕсли ТипЗначения = Тип("Строка") Тогда
			Результат.Добавить("");
		ИначеЕсли ТипЗначения = Тип("Дата") Тогда
			Результат.Добавить(фмДатаВремяКлиентСервер.ПустаяДата());
		Иначе
			МетаданныеТипа = Метаданные.НайтиПоТипу(ТипЗначения);
			Если МетаданныеТипа = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Результат.Добавить(Справочники[МетаданныеТипа.Имя].ПустаяСсылка());
		КонецЕсли;
	КонецЦикла;
	Если Типы.Количество() > 1 Тогда
		Результат.Добавить(Неопределено);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
