
#Область ПрограммныйИнтерфейс

// Создать логгер.
//
// Параметры:
//  ИерархияСобытия - Строка, ОбъектМетаданных - иерархия события.
// 
// Возвращаемое значение:
//  УправляемаяФорма, ОбработкаОбъект.фмЛоггер - контейнер для записи.
//
Функция СоздатьЛоггер(Знач ИерархияСобытия) Экспорт
	
	#Если ТонкийКлиент Или ВебКлиент Тогда
	Возврат СоздатьЛоггерНаКлиенте(ИерархияСобытия);
	#Иначе
	Возврат Обработки.фмЛоггер.СоздатьОбъект(ИерархияСобытия);
	#КонецЕсли
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Если ТонкийКлиент Или ВебКлиент Тогда

Функция СоздатьЛоггерНаКлиенте(Знач ИерархияСобытия)
	
	ПараметрыФормы = Новый Структура("ИерархияСобытия, ИмяКлиента", "", "");
	ПараметрыФормы.ИерархияСобытия = ИерархияСобытия;
	#Если Не ВебКлиент Тогда
	ПараметрыФормы.ИмяКлиента = ИмяКомпьютера();
	#КонецЕсли
	
	Возврат ПолучитьФорму("Обработка.фмЛоггер.Форма.ЗаписьНаКлиенте", ПараметрыФормы);
	
КонецФункции

#КонецЕсли

#КонецОбласти