
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ОбластьПрименения.Видимость = фмПараметрыПовтИсп.ИспользуетсяОбластьПримененияПараметра();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьСправку(Команда)
	
	Текст = ПолучитьСправку();
	ОткрытьФорму("РегистрСведений.фмПараметры.Форма.ФормаСправка", Новый Структура("Текст", Текст));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьСправку()
	Возврат ПолучитьОбщийМакет("фмОписаниеПараметров").ПолучитьТекст();
КонецФункции

#КонецОбласти